In [1]:
import pandas as pd

In [2]:
d1 = pd.DataFrame({"Name":['Ashwin','Aparnaa','Uma','Marimuthu','Uma','Marimuthu','Uma','Marimuthu','Uma','Marimuthu','Uma','Marimuthu','Uma','Marimuthu'],'Roll':[100,200,300,400,300,400,300,400,300,400,300,400,300,400],'Age':[19,19,45,50,45,50,45,50,45,50,45,50,45,50]},index = [1,2,3,4,5,6,7,8,9,10,11,12,13,14])

In [3]:
d1

         Name  Roll  Age
1      Ashwin   100   19
2     Aparnaa   200   19
3         Uma   300   45
4   Marimuthu   400   50
5         Uma   300   45
6   Marimuthu   400   50
7         Uma   300   45
8   Marimuthu   400   50
9         Uma   300   45
10  Marimuthu   400   50
11        Uma   300   45
12  Marimuthu   400   50
13        Uma   300   45
14  Marimuthu   400   50

In [5]:
# mean , meadian , min , max
d1.mean()

C:\Users\ashwi\AppData\Local\Temp\ipykernel_3828\3561397633.py:2: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  d1.mean()

Roll    321.428571
Age      43.428571
dtype: float64

In [6]:
d1.median()

C:\Users\ashwi\AppData\Local\Temp\ipykernel_3828\2192754866.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  d1.median()

Roll    300.0
Age      45.0
dtype: float64

In [7]:
d1.min()

Name    Aparnaa
Roll        100
Age          19
dtype: object

In [8]:
d1.max()

Name    Uma
Roll    400
Age      50
dtype: object

In [10]:
# frequency of a value in a column
d1["Age"].value_counts()

45    6
50    6
19    2
Name: Age, dtype: int64

In [11]:
# sorting the rows based on the values of a column
d1.sort_values(by = "Age")

         Name  Roll  Age
1      Ashwin   100   19
2     Aparnaa   200   19
3         Uma   300   45
5         Uma   300   45
7         Uma   300   45
9         Uma   300   45
11        Uma   300   45
13        Uma   300   45
4   Marimuthu   400   50
6   Marimuthu   400   50
8   Marimuthu   400   50
10  Marimuthu   400   50
12  Marimuthu   400   50
14  Marimuthu   400   50